<?php

$sum = 0; //В тази променлива ще натрупваме сумата, задаваме й начална стойност 0
$i = 1; //Ще използваме $i за контрол на условието на цикъла, както и за за числата от началното до желаното

while ($i < 6) {
    $sum += $i; //след като прибавим $i към сумата, ще увеличим $i с единица за да получим следващото число което трябва да добавим към сумата
    $i++;
}

echo "The sum of the numbers between 1 and 5 is: " . $sum . "<br />";

//Да се направи програма, която намира сумата на числата от:

//2 до 11
//10 до 20
//100 до 200
//101 до 111
